README.org
#+TITLE: Emacs Configuration
#+PROPERTY: header-args :tangle orginit.el
#+Author: Acharya U

* Emacs Config
This is my configuration of emacs
The things work poroperly

* Initial UI features
these are the initial UI features, like removing the scroll bar, tool bar etc. Basically to make it look more GNU/Linuxy
** remove the startup page
#+BEGIN_SRC elisp

(setq inhibit-startup-message t)

#+END_SRC

** my own confis to remove menu bar , scroll bar and tool bar
#+BEGIN_SRC elisp
  (tool-bar-mode -1)
  (menu-bar-mode -1)
  (scroll-bar-mode -1)
  (tooltip-mode 1)
#+END_SRC

** Make emacs transparent

#+BEGIN_SRC elisp
  ;; set transparency
  ;; (set-frame-parameter (selected-frame) 'alpha '(85 85))
  ;; (add-to-list 'default-frame-alist '(alpha 85 85))
#+END_SRC

* Font configuration
this is where font is configured
#+BEGIN_SRC elisp

;; ;;;; fonts and stuff

(defvar runemacs/default-font-size 150)

;;(set-face-attribute 'default nil :font "monospace" :height runemacs/default-font-size)

;; Set the fixed pitch face
(set-face-attribute 'default nil :font "Hack Nerd Font" :height 150)
;;(set-face-attribute 'fixed-pitch nil :font "Hack Nerd Font" :height 150)

;; Set the variable pitch face
(set-face-attribute 'variable-pitch nil :font "Cantarell" :height 120 :weight 'regular)

#+END_SRC

* Use Package
Here use package is configured to install and use packages from repos like melpa
** setting up melpa elpa and use-package

Initialize package sources
#+BEGIN_SRC elisp
(require 'package)

(setq package-archives '(("melpa" . "https://melpa.org/packages/")
                         ("org" . "https://orgmode.org/elpa/")
                         ("elpa" . "https://elpa.gnu.org/packages/")))

(package-initialize)
(unless package-archive-contents
 (package-refresh-contents))


;; Initialize use-package on non-Linux platforms
(unless (package-installed-p 'use-package)
   (package-install 'use-package))

(require 'use-package)
(setq use-package-always-ensure t)
#+END_SRC

** use the ivy package
#+BEGIN_SRC elisp
(use-package ivy
  :diminish
  :bind (("C-s" . swiper)
         :map ivy-minibuffer-map
         ("TAB" . ivy-alt-done)	
         ("C-l" . ivy-alt-done)
         ("C-j" . ivy-next-line)
         ("C-k" . ivy-previous-line)
         :map ivy-switch-buffer-map
         ("C-k" . ivy-previous-line)
         ("C-l" . ivy-done)
         ("C-d" . ivy-switch-buffer-kill)
         :map ivy-reverse-i-search-map
         ("C-k" . ivy-previous-line)
         ("C-d" . ivy-reverse-i-search-kill))
  :config
  (ivy-mode 1))
#+END_SRC

** Swiper
#+BEGIN_SRC elisp
(use-package swiper :ensure t)
#+END_SRC

** php-mode
#+BEGIN_SRC elisp
(use-package php-mode :ensure t)
#+END_SRC

** doom-modeline
use doom-modeline thingy
#+BEGIN_SRC elisp
(use-package doom-modeline
  :ensure t
  :init (doom-modeline-mode 1)
;;  :custom ((doom-modeline-height 25))
  )
#+END_SRC

** All the icons
 all the icons for the icons
#+BEGIN_SRC elisp 
(use-package all-the-icons
  :ensure t)
#+END_SRC

** other themes
some other themes than doom themes
#+BEGIN_SRC elisp
   ;; (use-package intellij-theme)
    ;;(use-package kaolin-themes)
    ;;(use-package zenburn-theme)
  ;;  (use-package spacemacs-theme)
  ;; (use-package ewal-spacemacs-themes)
  (use-package ubuntu-theme)
#+END_SRC

** doom themes
doom themes to make emacs look sexy
_NOTE: the themes are loaded here so make sure to install themes above here_
#+BEGIN_SRC elisp
          (use-package doom-themes
            :ensure t
            :config
            ;; Global settings (defaults)
            (setq doom-themes-enable-bold t    ; if nil, bold is universally disabled
                  doom-themes-enable-italic t) ; if nil, italics is universally disabled
        ;;    (load-theme ' spacemacs-dark t)
           ;; (load-theme ' kaolin-dark t)
          (load-theme 'doom-Iosvkem t)
  ;;        (load-theme 'ubuntu t)
    ;;        (load-theme 'doom-solarized-dark t)


            ;; Enable flashing mode-line on errors
            (doom-themes-visual-bell-config)
            ;; Enable custom neotree theme (all-the-icons must be installed!)
            (doom-themes-neotree-config)
            ;; or for treemacs users
            (setq doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
            (doom-themes-treemacs-config)
            ;; Corrects (and improves) org-mode's native fontification.
            (doom-themes-org-config)
            )
#+END_SRC

** Rainbow delemeters
#+BEGIN_SRC elisp
;;(use-package rainbow-delimiters
;;  :hook (prog-mode , rainbow-delimiters-mode ))
#+END_SRC

** which key mode
#+BEGIN_SRC elisp
(use-package which-key
  :init (which-key-mode)
  :diminish which-key-mode
  :config
  (setq which-key-idle-delay 0.3))
#+END_SRC

** ivy rich mode
#+BEGIN_SRC elisp
(use-package ivy-rich
 :init (ivy-rich-mode 1))
#+END_SRC

** properly setting up counsel
#+BEGIN_SRC elisp
(use-package counsel
  :bind (("M-x" . counsel-M-x)
;;       	 ("C-x b" . counsel-ibuffer)
       	 ("C-x b" . counsel-switch-buffer)
       	 ("C-x v" . counsel-describe-variable)
       	 ("C-x f" . counsel-describe-function)
	 ("C-x C-f" . counsel-find-file)
	 :map minibuffer-local-map
	  ("C-r" . 'counsel-minibuffer-history)))
#+END_SRC

** pdf-tools
make emacs a pdf viewer
#+BEGIN_SRC emacs-lisp
;;  (use-package pdf-tools
;;    :ensure t
;;    :defer t
;;    :commands (pdf-view-mode pdf-tools-install)
;;    :mode ("\\.[pP][dD][fF]\\" . pdf-view-mode)
;;    :config (pdf-tools-install)
;;    (define-pdf-cache-function pagelabels)
;;    :hook ((pdf-view-mode-hook . (lambda () (display-line-numbers-mode -q)))
;;           (pdf-view-mode-hook . pdf-tools-enable-minor-modes)))

#+END_SRC

** Howdoyou
this package lets you search stack overflow and it's sister sites and get your results back in org mode. This Package seems to be really cool
#+BEGIN_SRC emacs-lisp
  (use-package howdoyou
    :ensure t)
#+END_SRC

** Evil Mode configuration
Evil mode lets you run vim keybindings inside of emacs, best of both worlds
Everything here is for evil mode, make sure this is good
#+BEGIN_SRC elisp
(use-package evil
  :ensure t
  :init
  (setq evil-want-integration t)
  (setq evil-want-keybinding nil) ;; initiall nil
  (setq evil-want-C-u-scroll t)
  (setq evil-want-C-i-jump nil) ;; initially nil
;;  (setq evil-respect-visual-line-mode t)
  :config
  (evil-set-undo-system 'undo-tree) 
  (evil-mode 1)  
  (evil-set-initial-state 'messages-buffer-mode 'normal)
  (evil-set-initial-state 'dashboard-mode 'normal))
;; yay goddamit , it is vim now . finally , i am back home .
;; das ist sehr gut damn vim ist uber alles editors 
;; now for evil collection

(use-package evil-collection
  :after evil
  :config
  (evil-collection-init))

;; undo tree to make C-r in evil mode redo
(use-package undo-tree
  :ensure t
  :config
  (global-undo-tree-mode 1))
#+END_SRC

** auto complete
#+BEGIN_SRC elisp
;; auto complete and stuff
(use-package auto-complete
  :ensure t
;;  :config
;;  (require 'auto-complete-config)
;;;   (ac-config-default)
  )
#+END_SRC

** company mode
#+BEGIN_SRC elisp
(use-package company
  :after lsp-mode
  :hook (lsp-mode . company-mode)
  :bind (:map company-active-map
         ("<tab>" . company-complete-selection))
        (:map lsp-mode-map
         ("<tab>" . company-indent-or-complete-common))
	:custom
  (company-minimum-prefix-length 1)
  (company-idle-delay 0.1))

(use-package company-box
  :hook (company-mode . company-box-mode))

#+END_SRC

** yasnepet
#+BEGIN_SRC elisp
(use-package yasnippet
  :ensure t
  :config
  (yas-global-mode 1)
  (add-hook 'prog-mode-hook 'yas-minor-mode)
  )
#+END_SRC

** virtual terminal
A vertual terminal for emacs, I find it better than eshell
#+BEGIN_SRC elisp
   (use-package vterm
    :ensure t)
#+END_SRC

** becom mode
it looks kinda cool
#+BEGIN_SRC elisp
(use-package beacon)
#+END_SRC
use beacon mode, comment if you think it's annoyingj
#+BEGIN_SRC elisp
;;  (beacon-mode 1)
#+END_SRC

** neotree to flex on vim users

#+BEGIN_SRC elisp
  (use-package neotree
    :ensure t)
#+END_SRC

** Helpful
 helpful because system crafters said it was cool
#+BEGIN_SRC elisp 
(use-package helpful
  :custom
  (counsel-describe-function-function #'helpful-callable)
  (counsel-describe-variable-function #'helpful-variable)
  :bind
  ([remap describe-function] . counsel-describe-function)
  ([remap describe-command] . helpful-command)
  ([remap describe-variable] . counsel-describe-variable)
  ([remap describe-key] . helpful-key))
#+END_SRC

** rainbow delimiters
#+BEGIN_SRC elisp
(use-package rainbow-delimiters
  :hook (prog-mode . rainbow-delimiters-mode))
#+END_SRC

** markdown mode
#+BEGIN_SRC elisp
(use-package markdown-mode 
  :ensure t)
#+END_SRC

** simple-httpd
 for opening a web server at a spesefic directory because it is easier for me to make websites
 and also because i am too lazy to configure apache and stuff
#+BEGIN_SRC elisp
(use-package simple-httpd
  :ensure t)
#+END_SRC

** Elfeed
*** this package is used to read RSS feeds
#+BEGIN_SRC emacs-lisp
  ;; Configure Elfeed
  (use-package elfeed
    :ensure t
    :config
    (setq elfeed-db-directory (expand-file-name "elfeed" user-emacs-directory)
          elfeed-show-entry-switch 'display-buffer)

    (setq elfeed-search-filter "@6-months-ago +unread -lowy")
    )

#+END_SRC

