README.org
*** use some RSS links
#+BEGIN_SRC emacs-lisp
  (setq elfeed-feeds (quote(
  ("https://archlinux.org/feeds/news/" linux arch news official)
  )))
  ;; you can put your subs here like this
#+END_SRC

The way to get rss feed of a youtube channel
NOTE: do not use this function directly in the elfeed-feeds list. This function has to first go to the internet and get the whole page and this function is not multithreaded. This function exists for me to get the RSS feeds of the youtube channels.
This function just runs a shell command. The shell dependencies are curl and grep. They are available in almost all GNU/Linux systems. IDK and I dont care about other systems

this function is defined below the elfeed-feeds list so that nobody uses this function within that list. This will make emacs really slow as it needs to connect to the internet and fetch it. *Don't directly put it in the list above.*
#+BEGIN_SRC emacs-lisp
  (defun my/get-youtube-channel-rss-feed (link-to-channel-homepage)
    "this takes the link to channel home page and spits out the rss feed"
    (setq my-youtube-command (concat "curl -s " link-to-channel-homepage " | grep -oP '(?<=title\=\"RSS\" href\=\").*?(?=\")' "))
    (setq my-shell-output
          (substring 
           (shell-command-to-string my-youtube-command )
           0 -1))
    my-shell-output
    )
#+END_SRC

*** disable evil mode for all elfeed major modes
more mode hooks can be added when we find them
#+BEGIN_SRC emacs-lisp
  ;; (dolist (mode '(elfeed-show-mode-hook
  ;;                 elfeed-search-mode-hook))
  ;;   (add-hook mode (lambda () (turn-off-evil-mode))))
#+END_SRC

*** Elfeed functions
play a video in mpv
if the link of the opened elfeed is a video that can be played by mpv, this function can be used to directly play it.
#+BEGIN_SRC emacs-lisp
  (defun my/elfeed-open-link-in-mpv()
    "open link in elfeed using mpv"
    (interactive)
    (let ((link (elfeed-entry-link elfeed-show-entry)))
      (when link
        (message "Sent to mpv: %s" link)
        (async-shell-command (concat "mpv \"" link "\"")))))
#+END_SRC

*** make evil and elfeed play together
this is copy pasted from the internet, the entire comment is following:

I would suggest using evil-motion-state for Elfeed instead of normal state -- Elfeed buffers are read-only, so what you are really doing is moving around. Evil uses this approach for many other read-only buffers, for example help-mode. So:

#+BEGIN_SRC emacs-lisp
  (add-to-list 'evil-motion-state-modes 'elfeed-search-mode)
  (add-to-list 'evil-motion-state-modes 'elfeed-show-mode)
#+END_SRC

You can rebind some keys to get back important Elfeed functionality. Some examples:

#+BEGIN_SRC emacs-lisp
  (evil-define-key* 'motion elfeed-search-mode-map
    "gb" #'elfeed-search-browse-url
    "gr" #'elfeed-search-update--force
    "gR" #'elfeed-search-fetch)

  (evil-define-key* 'motion elfeed-show-mode-map
    "gb" #'elfeed-show-visit
    "gy" #'my/elfeed-open-link-in-mpv
    "gj" #'elfeed-show-next
    "gk" #'elfeed-show-prev)
#+END_SRC

(I assume you are not using Spacemacs and don't have access to evilify-map, as suggested by another answer.)

** projectile
projectile to move through projects blazingly fast
#+BEGIN_SRC elisp
(use-package projectile
  :diminish projectile-mode
  :config (projectile-mode)
  :custom ((projectile-completion-system 'ivy))
  :bind-keymap
  ("C-c p" . projectile-command-map)
  :init
  ;; ;; NOTE: Set this to the folder where you keep your Git repos!
  ;; (when (file-directory-p "~/Projects/Code")
  ;;   (setq projectile-project-search-path '("~/Projects/Code")))
  ;; (setq projectile-switch-project-action #'projectile-dired)
)

(use-package counsel-projectile
  :config (counsel-projectile-mode))

#+END_SRC  

** web mode
while writing html, i guess
#+BEGIN_SRC elisp
(use-package web-mode
  :ensure t)
#+END_SRC

** for javascript and typescript
this is for javascript, even though lsp just does the job anyway
#+BEGIN_SRC elisp
(use-package typescript-mode
  :mode "\\.ts\\'"
  :hook (typescript-mode . lsp-deferred)
  :config
  (setq typescript-indent-level 2))
#+END_SRC

** flycheck
it checks for errors blazingly fast
#+BEGIN_SRC elisp
(use-package flycheck
  :ensure t)
#+END_SRC

** magit
magit is a git client, people say it's really good so i'm planning to test it out
#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t)
#+END_SRC

** gnuplot mode
this package is here just to support ploting in org mode, IDK how to use this package indipendently right now

#+BEGIN_SRC emacs-lisp
  (use-package gnuplot-mode)
  (use-package gnuplot)
#+END_SRC

** rainbow-mode
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-mode
    :ensure t
    :init (rainbow-mode 1))
#+END_SRC

** dashboard
*** install dashboard

#+BEGIN_SRC emacs-lisp
  (use-package dashboard
    :ensure t
    :config
    (dashboard-setup-startup-hook))
#+END_SRC

*** customize dashboard
First make things be in the centre

#+BEGIN_SRC emacs-lisp
(setq dashboard-center-content t)
#+END_SRC

enable icons

#+BEGIN_SRC emacs-lisp
  (setq dashboard-set-heading-icons t)
  (setq dashboard-set-file-icons t)
#+END_SRC

using the dashboard mode hook

- set keybinding to refresh when pressing *C-c C-r* key in dashboard
- refresh once on startup to show icons ( there seems to be a bug here )

#+BEGIN_SRC emacs-lisp
  (add-hook 'dashboard-mode-hook (lambda ()
                                   (local-set-key (kbd "C-c C-r ") 'dashboard-refresh-buffer)))
#+END_SRC

*** make initial buffer for emacs client the dashboard

#+BEGIN_SRC emacs-lisp
(setq initial-buffer-choice (lambda () (get-buffer-create "*dashboard*")))
#+END_SRC

** all the icons dired
all the icons for dired
#+BEGIN_SRC emacs-lisp
  (use-package all-the-icons-dired
    :ensure t
    :hook (dired-mode . all-the-icons-dired-mode)
    )
#+END_SRC

* for LaTeX

#+BEGIN_SRC elisp
  (use-package auctex
    :ensure t
    :defer t
    :hook (LaTeX-mode .
                      (lambda ()
                        (push (list 'output-pdf "Zathura")
                              TeX-view-program-selection))))
#+END_SRC

* LSP
LSP is Language Server Protocol, this is what gives IDE features to Emacs
** lsp mode
initual lsp mode setup function
#+BEGIN_SRC elisp
(defun lsp-mode-setup ()
  (setq lsp-headerline-breadcrumb-segments '(path-up-to-project file symbols))
  (lsp-headerline-breadcrumb-mode))

#+END_SRC

** Install lsp-mode and configure it using use-package
#+BEGIN_SRC elisp
(use-package lsp-mode
  :commands (lsp lsp-deferred)
  :hook (lsp-mode . lsp-mode-setup)
  :init
  (setq lsp-keymap-prefix "C-c l")  ;; Or 'C-l', 's-l'
  :config
  (lsp-enable-which-key-integration t))

#+END_SRC  

** lsp ui
IDK what it does, but it seems like it makes lsp look better
#+BEGIN_SRC elisp
(use-package lsp-ui
  :hook (lsp-mode . lsp-ui-mode)
  :custom
  (lsp-ui-doc-position 'bottom))
#+END_SRC

** lsp treemacs
LSP treemacs, IDK what it does, I just copied lol
#+BEGIN_SRC elisp
(use-package lsp-treemacs
  :ensure t
  :after lsp)
#+END_SRC

** lsp ivy
I copied this as well, IDK what this does
#+BEGIN_SRC elisp
(use-package lsp-ivy
  :ensure t)
#+END_SRC

* ORG configuration 
this is for org mode, the greatest markdown format, i guess
** setting initial stuff up
IDK how the hell this works, i just copied this. I just wish this works

#+BEGIN_SRC elisp
(defun efs/org-mode-setup ()
  (org-indent-mode)
  (variable-pitch-mode 1)
  (visual-line-mode 1))



(defun efs/org-font-setup ()
  ;; Replace list hyphen with dot
  (font-lock-add-keywords 'org-mode
                          '(("^ *\\([-]\\) "
                             (0 (prog1 () (compose-region (match-beginning 1) (match-end 1) "•"))))))

  ;; Set faces for heading levels
  (dolist (face '((org-level-1 . 1.2)
                  (org-level-2 . 1.1)
                  (org-level-3 . 1.05)
                  (org-level-4 . 1.0)
                  (org-level-5 . 1.1)
                  (org-level-6 . 1.1)
                  (org-level-7 . 1.1)
                  (org-level-8 . 1.1)))
    (set-face-attribute (car face) nil :font "Hack" :weight 'regular :height (cdr face)))



  ;; Ensure that anything that should be fixed-pitch in Org files appears that way
  (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch)
  (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-table nil   :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
  (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
  (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch))
#+END_SRC

** Actually install the packages org and org-bullets
#+BEGIN_SRC elisp
(use-package org
  :hook (org-mode . efs/org-mode-setup)
  :config
  (setq org-ellipsis " ▾")
  (efs/org-font-setup))


(use-package org-bullets
  :after org
  :hook (org-mode . org-bullets-mode)
  ;; :custom
  ;;  (org-bullets-bullet-list '("◉" "○" "●" "○" "●" "○" "●"))
  )
#+END_SRC

** configure org bullets
#+BEGIN_SRC elisp
(defun efs/org-mode-visual-fill ()
  (setq visual-fill-column-width 100
        visual-fill-column-center-text t)
  (visual-fill-column-mode 1))

(use-package visual-fill-column
  :hook (org-mode . efs/org-mode-visual-fill))
#+END_SRC

** org pdf

#+BEGIN_SRC elisp
;;  (use-package org-pdftools
 ;;   :hook (org-load-hook . org-pdftools-setup-link))
#+END_SRC

** Org reveal for slideshow presentations
#+BEGIN_SRC elisp
(use-package ox-reveal
  :ensure t)
#+END_SRC

