README.org
** Add a function to set size for latex math equation size
this function is an interactive function that makes setting the size of math equations more quality of life friendly.
Now you won't have to go to that file where you stored the code every time you decide to write math equations

#+BEGIN_SRC emacs-lisp
  (defun my/set_latex_math_size (size)
    "set the required size of your math equations"
      (interactive "sSize:")
      (setq org-format-latex-options (plist-put org-format-latex-options :scale (string-to-number size)))
      (message (concat "size is set to: " size)))
#+END_SRC

* The Rust Programming Language
while writing this, rust is my favouraite programming language. Even though LSP does most of the job, i still keep some more great rust features just because i like rust
** flycheck for rust
checks for errors in the buffer
#+BEGIN_SRC elisp
(use-package flycheck-rust
  :ensure t)
#+END_SRC

** some random shit to make it work better

yes
#+BEGIN_SRC elisp
;; (defun rk/rustic-mode-hook ()
;;   ;; so that run C-c C-c C-r works without having to confirm, but don't try to
;;   ;; save rust buffers that are not file visiting. Once
;;   ;; https://github.com/brotzeit/rustic/issues/253 has been resolved this should
;;   ;; no longer be necessary.
;;   (when buffer-file-name
;;     (setq-local buffer-save-without-query t)))
#+END_SRC

** rustic
more advanced rust-mode which has some great features and added keybindings
#+BEGIN_SRC elisp
  (use-package rustic
    :ensure
    :bind (:map rustic-mode-map
                ("M-j" . lsp-ui-imenu)
                ("M-?" . lsp-find-references)
                ("C-c C-c l" . flycheck-list-errors)
                ("C-c C-c a" . lsp-execute-code-action)
                ("C-c C-c r" . lsp-rename)
                ("C-c C-c q" . lsp-workspace-restart)
                ("C-c C-c Q" . lsp-workspace-shutdown)
                ("C-c C-c s" . lsp-rust-analyzer-status))
    :config
    ;; uncomment for less flashiness
    ;; (setq lsp-eldoc-hook nil)
    ;; (setq lsp-enable-symbol-highlighting nil)
    ;; (setq lsp-signature-auto-activate nil)
    ;; comment to disable rustfmt on save
    (setq rustic-format-on-save t)
    ;;(add-hook 'rustic-mode-hook 'lsp)
    ;;(add-hook 'rustic-mode-hook 'electric-part-local-mode)
    )
#+END_SRC  

* User Defined
Here I keep my user defined functions
user defined functions (starts with my/)
** to get the ide layout like vscode with neotree and stuff
#+BEGIN_SRC elisp
  (defun my/ide()
    "Get a modern IDE layout"
    (interactive)
    (evil-window-split)
    (evil-window-down 1)
    (evil-window-decrease-height 10)
    (vterm)
    (neotree)
    (evil-window-right 1)
    (lsp)
    )
#+END_SRC

** a keybinding for howdoyou
#+BEGIN_SRC elisp
  (global-set-key (kbd "C-h j") 'howdoyou-query)
#+END_SRC

** run gcc for c mode
make a keybinding to run gcc to the opened file and run a.out
#+BEGIN_SRC elisp
  (defun my/run-the-c-code()
    "run the c code via gcc"
    (interactive)
    (eshell-command (concat "gcc " (buffer-file-name) " && ./a.out"))
    )
  (defun my/make()
    "run the c code via gcc"
    (interactive)
    (eshell-command "make")
    )


  (add-hook 'c-mode-common-hook (lambda()
                                  (local-set-key (kbd "C-c C-r C-c") 'my/run-the-c-code)
                                  (local-set-key (kbd "C-c C-r C-m") 'my/make)
                                  ))
  ;;(add-hook 'c-mode-common-hook (local-set-key (kbd "C-c C-r") (eshell-command (concat "gcc " (buffer-file-name) " && ./a.out") )))
#+END_SRC

** run shell scripts after making it executable
repurposed the c mode keybinding to run shell scripts

#+BEGIN_SRC elisp
  (defun my/run-the-bash-code()
    "run the bash code, NOTE: it gives executable permissions to the file (oviously)"
    (interactive)
    (eshell-command (concat "chmod +x " (buffer-file-name) " && bash " (buffer-file-name)))
    )
  (add-hook 'sh-mode-hook (lambda() (local-set-key (kbd "C-c C-r")
                                                   'my/run-the-bash-code
                                                   )))
#+END_SRC

** bracket completion in prog mode 
Use electric pair mode or something in prog mode hook
NOTE: Does not work rignt now, so not conna care
#+BEGIN_SRC elisp
  (add-hook 'prog-mode-hook (lambda () (electric-pair-local-mode 1)))
#+END_SRC

** launch company mode every time in lisp mode
#+BEGIN_SRC emacs-lisp
  (add-hook 'emacs-lisp-mode-hook (lambda ()
                                    (company-mode 1)))
#+END_SRC

** put the cursor to the next <+_+> and replace it
this is inspired from luke smith, it's in my opinion pretty cool

first, the function my/goto-thing is defined
#+BEGIN_SRC emacs-lisp
(defun my/goto-thing ()
  "put cursor to the string <+_+> and replace it"
  (interactive)
  (if (search-forward "<+_+>") (delete-backward-char 5) (message "pattern <+_+> not found"))
  )
#+END_SRC

then, keybinding for it is set to C-c C-SPC
#+BEGIN_SRC emacs-lisp
  (global-set-key (kbd "C-c C-SPC") 'my/goto-thing)
#+END_SRC

** Insert math from within latex in emacs org mode
this is so that i get better keybindings when working with latex in org mode.
the trick was to open up a temp latex buffer and use keybinding from there
and finally after I'm done there, pasting everything from there to org

first we need the function to copy all of the buffer and kill it
#+BEGIN_SRC emacs-lisp
  (defun my/copy-all-and-kill()
      (interactive)
      (kill-region 1 (buffer-size))
      (kill-buffer-and-window)
    )
#+END_SRC

then, we need a function to open the latex buffer and set a keybinding to copy and kill
#+BEGIN_SRC emacs-lisp
  (defun my/open-latex-buffer ()
    (interactive)
    (split-window)
    (switch-to-buffer "*org-latex-thingy*")
    (latex-mode)
    (local-set-key (kbd "C-C C-;") 'my/copy-all-and-kill ))
#+END_SRC

then we set a hook to put a keybinding in org mode to start the buffer

#+BEGIN_SRC emacs-lisp
  (add-hook 'org-mode-hook (lambda()
                             (local-set-key (kbd "C-c C-.") 'my/open-latex-buffer)))
#+END_SRC

** other random stuff
*** allow these mentioned languages to compile and give result from org source blocks
#+BEGIN_SRC elisp
  (org-babel-do-load-languages
   'org-babel-load-languages
   '(
     (C . t)
     (emacs-lisp . t)
     (python . t)
     )
   )
  ;; custom keybindings

#+END_SRC

* End Stuff
** Start a org document scratch buffer
This is just me running one command after another to get what I want, i guess this is not very efficient
Gonna give up for now, It didn't work properly
#+BEGIN_SRC elisp
  ;; (switch-to-buffer "orgscratch")
  ;; (org-mode)
  ;; (text-scale-adjust 2)
  ;; (display-line-numbers-mode 0)
  ;; (insert "* Notes")
  ;; (switch-to-buffer "*scratch*")
#+END_SRC

