orginit.el

(defun my/set_latex_math_size (size)
  "set the required size of your math equations"
    (interactive "sSize:")
    (setq org-format-latex-options (plist-put org-format-latex-options :scale (string-to-number size)))
    (message (concat "size is set to: " size)))

(use-package flycheck-rust
  :ensure t)

;; (defun rk/rustic-mode-hook ()
;;   ;; so that run C-c C-c C-r works without having to confirm, but don't try to
;;   ;; save rust buffers that are not file visiting. Once
;;   ;; https://github.com/brotzeit/rustic/issues/253 has been resolved this should
;;   ;; no longer be necessary.
;;   (when buffer-file-name
;;     (setq-local buffer-save-without-query t)))

(use-package rustic
  :ensure
  :bind (:map rustic-mode-map
              ("M-j" . lsp-ui-imenu)
              ("M-?" . lsp-find-references)
              ("C-c C-c l" . flycheck-list-errors)
              ("C-c C-c a" . lsp-execute-code-action)
              ("C-c C-c r" . lsp-rename)
              ("C-c C-c q" . lsp-workspace-restart)
              ("C-c C-c Q" . lsp-workspace-shutdown)
              ("C-c C-c s" . lsp-rust-analyzer-status))
  :config
  ;; uncomment for less flashiness
  ;; (setq lsp-eldoc-hook nil)
  ;; (setq lsp-enable-symbol-highlighting nil)
  ;; (setq lsp-signature-auto-activate nil)
  ;; comment to disable rustfmt on save
  (setq rustic-format-on-save t)
  ;;(add-hook 'rustic-mode-hook 'lsp)
  ;;(add-hook 'rustic-mode-hook 'electric-part-local-mode)
  )

(defun my/ide()
  "Get a modern IDE layout"
  (interactive)
  (evil-window-split)
  (evil-window-down 1)
  (evil-window-decrease-height 10)
  (vterm)
  (neotree)
  (evil-window-right 1)
  (lsp)
  )

(global-set-key (kbd "C-h j") 'howdoyou-query)

(defun my/run-the-c-code()
  "run the c code via gcc"
  (interactive)
  (eshell-command (concat "gcc " (buffer-file-name) " && ./a.out"))
  )
(defun my/make()
  "run the c code via gcc"
  (interactive)
  (eshell-command "make")
  )


(add-hook 'c-mode-common-hook (lambda()
                                (local-set-key (kbd "C-c C-r C-c") 'my/run-the-c-code)
                                (local-set-key (kbd "C-c C-r C-m") 'my/make)
                                ))
;;(add-hook 'c-mode-common-hook (local-set-key (kbd "C-c C-r") (eshell-command (concat "gcc " (buffer-file-name) " && ./a.out") )))

(defun my/run-the-bash-code()
  "run the bash code, NOTE: it gives executable permissions to the file (oviously)"
  (interactive)
  (eshell-command (concat "chmod +x " (buffer-file-name) " && bash " (buffer-file-name)))
  )
(add-hook 'sh-mode-hook (lambda() (local-set-key (kbd "C-c C-r")
                                                 'my/run-the-bash-code
                                                 )))

(add-hook 'prog-mode-hook (lambda () (electric-pair-local-mode 1)))

(add-hook 'emacs-lisp-mode-hook (lambda ()
                                  (company-mode 1)))

(defun my/goto-thing ()
  "put cursor to the string <+_+> and replace it"
  (interactive)
  (if (search-forward "<+_+>") (delete-backward-char 5) (message "pattern <+_+> not found"))
  )

(global-set-key (kbd "C-c C-SPC") 'my/goto-thing)

(defun my/copy-all-and-kill()
    (interactive)
    (kill-region 1 (buffer-size))
    (kill-buffer-and-window)
  )

(defun my/open-latex-buffer ()
  (interactive)
  (split-window)
  (switch-to-buffer "*org-latex-thingy*")
  (latex-mode)
  (local-set-key (kbd "C-C C-;") 'my/copy-all-and-kill ))

(add-hook 'org-mode-hook (lambda()
                           (local-set-key (kbd "C-c C-.") 'my/open-latex-buffer)))

(org-babel-do-load-languages
 'org-babel-load-languages
 '(
   (C . t)
   (emacs-lisp . t)
   (python . t)
   )
 )
;; custom keybindings

;; (switch-to-buffer "orgscratch")
;; (org-mode)
;; (text-scale-adjust 2)
;; (display-line-numbers-mode 0)
;; (insert "* Notes")
;; (switch-to-buffer "*scratch*")
